// === Генерация пользовательских событий ===
// Можно не только назначать обработчики, но и генерировать события из JavaScript-кода.

// Пользовательские события могут быть использованы при создании графических компонентов. Например, корневой элемент нашего меню, реализованного при помощи JavaScript, может генерировать события, относящиеся к этому меню: open (меню раскрыто), select (выбран пункт меню) и т.п. А другой код может слушать эти события и узнавать, что происходит с меню.

// Можно генерировать не только совершенно новые, придуманные нами события, но и встроенные, такие как click, mousedown и другие. Это бывает полезно для автоматического тестирования.

// Конструктор Event
// Встроенные классы для событий формируют иерархию аналогично классам для DOM-элементов. Её корнем является встроенный класс Event.

// Событие встроенного класса Event можно создать так:

// let event = new Event(type[, options]);
// Где:

// type – тип события, строка, например "click" или же любой придуманный нами – "my-event".
// options – объект с тремя необязательными свойствами:
// bubbles: true/false – если true, тогда событие всплывает.
// cancelable: true/false – если true, тогда можно отменить действие по умолчанию. Позже мы разберём, что это значит для пользовательских событий.
// composed: true/false – если true, тогда событие будет всплывать наружу за пределы Shadow DOM.
// По умолчанию все три свойства установлены в false: {bubbles: false, cancelable: false, composed: false}.
